alacritty
archlinuxcn-keyring
autojump
base
base-devel
bash-completion
blueman
btop
cliphist
conky
cuda-tools
discord
dunst
efibootmgr
fastfetch
fcitx5
fcitx5-chinese-addons
fcitx5-configtool
fcitx5-gtk
fcitx5-pinyin-moegirl
fcitx5-qt
firefox
gnome-keyring
grim
grub
hyprland-git
intel-ucode
jq
kitty
less
lib32-mesa
lib32-nvidia-utils
lib32-vulkan-intel
libva-nvidia-driver
linux
linux-firmware
linux-headers
lsb-release
man-db
miniconda
mpich
mpv
namcap
ncmpcpp
needrestart
network-manager-applet
networkmanager
nnn
noto-fonts-cjk
nvidia-dkms
nvidia-prime
nvidia-settings
obs-studio
os-prober
otf-font-awesome
pacman-contrib
pamixer
paru
pipewire-pulse
pkgfile
polkit-gnome
python-requests
rofi
slurp
sway
swaybg
swayidle
telegram-desktop
thefuck
timeshift
udiskie
ufw
v2raya-git
vim
visual-studio-code-bin
vlc
vulkan-intel
waybar-git
wofi
xdg-desktop-portal-hyprland
xorg-xeyes
zsh-autosuggestions
zsh-completions
zsh-history-substring-search
zsh-syntax-highlighting-git
zsh-theme-powerlevel10k
