alacritty
archlinuxcn-keyring
autojump
base
base-devel
bash-completion
blueman
btop
cliphist
conky
cuda-tools
discord
dunst
efibootmgr
fastfetch
fcitx5-configtool
fcitx5-rime
firefox
freeplane
gnome-keyring
google-chrome
grim
grub
hugo
hyprland
intel-ucode
jq
julia
kitty
less
lib32-mesa
lib32-nvidia-utils
lib32-vulkan-intel
libva-nvidia-driver
light-git
linux
linux-firmware
linux-headers
lsb-release
man-db
miniconda
mpc
mpd
mpich
mpv
namcap
ncmpcpp
needrestart
net-tools
network-manager-applet
networkmanager
nnn
noto-fonts
noto-fonts-cjk
noto-fonts-emoji
nvidia
nvidia-prime
nvidia-settings
obs-studio
os-prober
otf-font-awesome
pacman-contrib
pamixer
paru
pavucontrol
pcmanfm
pipewire-pulse
pkgfile
polkit-gnome
python-requests
rofi
slurp
swaybg
swayidle
telegram-desktop
thefuck
timeshift
ttf-iosevka-nerd
ttf-roboto
ttf-roboto-mono-nerd
udiskie
ufw
unzip
v2raya
vim
visual-studio-code-bin
vlc
vulkan-intel
waybar
wf-recorder
wofi
xdg-desktop-portal-hyprland
xorg-xeyes
zerotier-one
zotero-bin
zsh-autosuggestions
zsh-completions
zsh-history-substring-search
zsh-syntax-highlighting
zsh-theme-powerlevel10k
