alacritty
alsa-utils
archlinuxcn-keyring
audacious
base
base-devel
bash-completion
btop
cblas
cheese
cuda-tools
cudnn
dconf-editor
dhcpcd
efibootmgr
eog
evince
fcitx5-chinese-addons
fcitx5-configtool
fcitx5-material-color
fcitx5-pinyin-zhwiki
file-roller
filezilla
firefox
flameshot
freeplane
gcc-fortran
gdm
geary
git
gnome-backgrounds
gnome-browser-connector
gnome-calculator
gnome-calendar
gnome-characters
gnome-clocks
gnome-color-manager
gnome-connections
gnome-console
gnome-contacts
gnome-control-center
gnome-disk-utility
gnome-font-viewer
gnome-keyring
gnome-logs
gnome-maps
gnome-menus
gnome-music
gnome-photos
gnome-screenshot
gnome-session
gnome-settings-daemon
gnome-shell
gnome-shell-extension-dash-to-dock
gnome-shell-extensions
gnome-system-monitor
gnome-terminal
gnome-text-editor
gnome-themes-extra
gnome-tweaks
gnome-user-docs
gnome-user-share
gnome-video-effects
gnome-weather
grilo-plugins
grub
gst-libav
gufw
gvfs
gvfs-afc
gvfs-goa
gvfs-google
gvfs-gphoto2
gvfs-mtp
gvfs-nfs
gvfs-smb
intel-ucode
kvantum
lib32-mesa
lib32-nvidia-utils
lib32-vulkan-intel
libdisplay-info
libgdm
libreoffice-extension-texmaths
libreoffice-fresh-zh-cn
libxaw
linux
linux-firmware
man-db
miniconda
mpv
nautilus
neofetch
netpbm
networkmanager
ntfs-3g
nvidia
nvidia-settings
nvidia-utils
obs-studio
openssh
os-prober
pacman-contrib
paru
pipewire-alsa
pipewire-jack
pipewire-pulse
pkgfile
python-pip
qbittorrent
qt5-wayland
qt6-wayland
rygel
scons
simple-scan
steam
sushi
swig
tor-browser
tracker3-miners
ttf-font-awesome
v2raya
vim
vlc
vulkan-intel
wget
wireplumber
wqy-zenhei
xdg-desktop-portal
xdg-user-dirs-gtk
xdg-utils
yelp
zerotier-one
zotero-bin
zsh-autosuggestions
zsh-completions
zsh-syntax-highlighting
zsh-theme-powerlevel10k
