a52dec
abseil-cpp
accounts-qml-module
accountsservice
acl
adobe-source-code-pro-fonts
adwaita-cursors
adwaita-icon-theme
aha
alacritty
alsa-card-profiles
alsa-lib
alsa-topology-conf
alsa-ucm-conf
aom
appstream
appstream-qt
appstream-qt5
archlinux-appstream-data
archlinux-keyring
archlinuxcn-keyring
argon2
aribb24
at-spi2-core
atkmm
attica
attr
audiofile
audit
autoconf
autojump
automake
avahi
baloo
baloo-widgets
base
base-devel
bash
bash-completion
bc
binutils
bison
blas
blas64-openblas
bluedevil
bluez
bluez-libs
bluez-qt
bolt
boost-libs
botan2
breeze
breeze-gtk
breeze-icons
brotli
btop
btrfs-progs
bubblewrap
bzip2
c-ares
ca-certificates
ca-certificates-mozilla
ca-certificates-utils
cairo
cairomm
cantarell-fonts
capnproto
cblas
cdparanoia
cfitsio
chromaprint
cifs-utils
clinfo
cliphist
conky
convertlit
coreutils
cronie
cryptsetup
cuda
cuda-tools
cuda11
cuda11-tools
curl
dav1d
db5.3
dbus
dbus-broker
dbus-broker-units
dbus-glib
dconf
ddcutil
debugedit
debuginfod
default-cursors
desktop-file-utils
device-mapper
diffutils
discord
discount
discover
dmidecode
dolphin
double-conversion
downgrade
drkonqi
duktape
dunst
e2fsprogs
ebook-tools
editorconfig-core-c
efibootmgr
efivar
egl-wayland
eglexternalplatform
electron28
electronic-wechat-uos-bin
elfutils
embree
enchant
exiv2
expat
faad2
fakeroot
fastfetch
fcitx5
fcitx5-chinese-addons
fcitx5-configtool
fcitx5-gtk
fcitx5-pinyin-moegirl
fcitx5-qt
fcitx5-rime
ffmpeg
ffmpeg4.4
fftw
file
filesystem
findutils
firefox
flac
flameshot
flex
fluidsynth
fmt
fontconfig
frameworkintegration
freefilesync-bin
freeglut
freeplane
freetype2
fribidi
fuse-common
fuse2
fuse3
fzf
gawk
gc
gcc
gcc-fortran
gcc-libs
gcc11
gcc11-fortran
gcc11-libs
gcr
gcr-4
gd
gdb
gdb-common
gdbm
gdk-pixbuf2
geoclue
gettext
gflags
giflib
git
gjs
glib-networking
glib2
glibc
glibmm
glibmm-2.68
glslang
glu
gmp
gnome-keyring
gnupg
gnutls
gobject-introspection-runtime
google-chrome
google-glog
gperftools
gpgme
gpm
graphene
graphite
grep
grim
groff
grub
gsettings-desktop-schemas
gsm
gssdp
gst-plugins-bad-libs
gst-plugins-base
gst-plugins-base-libs
gstreamer
gtk-layer-shell
gtk-update-icon-cache
gtk2
gtk3
gtkmm3
guile
gupnp
gupnp-igd
gzip
harfbuzz
hicolor-icon-theme
hidapi
highway
http-parser
hugo
hunspell
hwdata
hwloc
hyphen
hyprcursor
hyprland
hyprlang
i2c-tools
iana-etc
icu
imath
imlib2
intel-oneapi-hpckit-2023
intel-ucode
iproute2
iptables
iputils
iso-codes
iucode-tool
jansson
jasper
java-environment-common
java-runtime-common
jbigkit
jdk-openjdk
jq
jre8-openjdk
jre8-openjdk-headless
js115
json-c
json-glib
jsoncpp
julia
kaccounts-integration
kactivitymanagerd
karchive
kauth
kbd
kbookmarks
kcmutils
kcodecs
kcolorscheme
kcompletion
kconfig
kconfigwidgets
kcoreaddons
kcrash
kdbusaddons
kde-cli-tools
kde-gtk-config
kdeclarative
kdecoration
kded
kdeplasma-addons
kdesu
kdnssd
kdsoap-qt6
kdsoap-ws-discovery-client
keyutils
kfilemetadata
kgamma
kglobalaccel
kglobalacceld
kguiaddons
kguiaddons5
kholidays
ki18n
kiconthemes
kidletime
kinfocenter
kio
kio-extras
kio-fuse
kirigami
kirigami-addons
kitemmodels
kitemviews
kitty
kitty-shell-integration
kitty-terminfo
kjobwidgets
kmenuedit
kmod
knewstuff
knotifications
knotifyconfig
konsole
kpackage
kparts
kpipewire
kpty
kquickcharts
krb5
krunner
kscreen
kscreenlocker
kservice
ksshaskpass
kstatusnotifieritem
ksvg
ksystemstats
ktexteditor
ktextwidgets
kunitconversion
kuserfeedback
kwallet
kwallet-pam
kwayland
kwayland-integration
kwayland5
kwidgetsaddons
kwin
kwindowsystem
kwindowsystem5
kwrited
kxmlgui
l-smash
lame
lapack
layer-shell-qt
lcms2
ldb
less
level-zero-loader
leveldb
lib32-brotli
lib32-bzip2
lib32-curl
lib32-e2fsprogs
lib32-expat
lib32-gcc-libs
lib32-glibc
lib32-icu
lib32-keyutils
lib32-krb5
lib32-libcap
lib32-libdrm
lib32-libelf
lib32-libffi
lib32-libgcrypt
lib32-libglvnd
lib32-libgpg-error
lib32-libidn2
lib32-libldap
lib32-libnghttp2
lib32-libnghttp3
lib32-libpciaccess
lib32-libpsl
lib32-libssh2
lib32-libtirpc
lib32-libunistring
lib32-libunwind
lib32-libx11
lib32-libxau
lib32-libxcb
lib32-libxcrypt
lib32-libxdamage
lib32-libxdmcp
lib32-libxext
lib32-libxfixes
lib32-libxml2
lib32-libxshmfence
lib32-libxxf86vm
lib32-llvm-libs
lib32-lm_sensors
lib32-mesa
lib32-ncurses
lib32-nvidia-utils
lib32-openssl
lib32-pam
lib32-systemd
lib32-util-linux
lib32-vulkan-icd-loader
lib32-vulkan-intel
lib32-wayland
lib32-xcb-util-keysyms
lib32-xz
lib32-zlib
lib32-zstd
libaccounts-glib
libaccounts-qt
libaio
libao
libappindicator-gtk3
libarchive
libass
libassuan
libasyncns
libatasmart
libavc1394
libavif
libb2
libblastrampoline
libblockdev
libblockdev-crypto
libblockdev-fs
libblockdev-loop
libblockdev-mdraid
libblockdev-nvme
libblockdev-part
libblockdev-swap
libbluray
libbpf
libbs2b
libbsd
libbytesize
libcamera
libcamera-ipa
libcanberra
libcap
libcap-ng
libcdio
libcdio-paranoia
libcgif
libcloudproviders
libcolord
libcups
libdaemon
libdatachannel
libdatrie
libdbusmenu-glib
libdbusmenu-gtk3
libdca
libde265
libdecor
libdeflate
libdispatch
libdisplay-info
libdmtx
libdovi
libdrm
libdvbpsi
libdvdnav
libdvdread
libebml
libedit
libei
libelf
libepoxy
libevdev
libevent
libexif
libfabric
libfdk-aac
libffi
libfontenc
libfreeaptx
libgcrypt
libgee
libgirepository
libgit2
libglvnd
libgme
libgnomekbd
libgpg-error
libgudev
libheif
libice
libid3tag
libidn
libidn2
libiec61883
libimagequant
libime
libimobiledevice
libimobiledevice-glue
libinih
libinput
libinstpatch
libisl
libjpeg-turbo
libjuice
libjxl
libkexiv2
libksba
libkscreen
libksysguard
liblc3
libldac
libldap
libliftoff
libmad
libmatroska
libmbim
libmd
libmfx
libmicrohttpd
libmikmod
libmm-glib
libmms
libmng
libmnl
libmodplug
libmpc
libmpcdec
libmpdclient
libmpeg2
libmspack
libmtp
libmysofa
libnatpmp
libndp
libnet
libnetfilter_conntrack
libnewt
libnfnetlink
libnfs
libnftnl
libnghttp2
libnghttp3
libngtcp2
libnice
libnl
libnm
libnma
libnma-common
libnotify
libnsl
libnvme
libogg
libomxil-bellagio
libopenmpt
libp11-kit
libpcap
libpciaccess
libpgm
libpipeline
libpipewire
libplacebo
libplasma
libplist
libpng
libproxy
libpsl
libpulse
libqaccessibilityclient-qt6
libqalculate
libqmi
libqrtr-glib
libraqm
libraw
libraw1394
librime
librime-data
librsvg
librsync
libsamplerate
libsasl
libseccomp
libsecret
libshout
libsidplayfp
libsigc++
libsigc++-3.0
libsixel
libsm
libsndfile
libsodium
libsoup3
libsoxr
libsrtp
libssh
libssh2
libstemmer
libsysprof-capture
libtar
libtasn1
libteam
libthai
libtheora
libtiff
libtirpc
libtommath
libtool
libunibreak
libunistring
libunwind
libupnp
liburing
libusb
libusbmuxd
libutempter
libutf8proc
libuv
libva
libva-nvidia-driver
libvdpau
libverto
libvips
libvorbis
libvpl
libvpx
libwacom
libwbclient
libwebp
libwireplumber
libx11
libxau
libxaw
libxcb
libxcomposite
libxcrypt
libxcrypt-compat
libxcursor
libxcvt
libxdamage
libxdg-basedir
libxdmcp
libxext
libxfixes
libxfont2
libxft
libxi
libxinerama
libxkbcommon
libxkbcommon-x11
libxkbfile
libxklavier
libxml2
libxmlb
libxmu
libxnvctrl
libxp
libxpm
libxpresent
libxrandr
libxrender
libxshmfence
libxslt
libxss
libxt
libxtst
libxv
libxxf86vm
libyaml
libyuv
libzip
licenses
light-git
lilv
linux
linux-api-headers
linux-firmware
linux-firmware-whence
linux-headers
linuxqq
lld
llvm-julia-libs
llvm-libs
lm_sensors
lmdb
lsb-release
lsof
lua
lua52
luajit
lv2
lvm2
lz4
lzo
m4
madagascar-git
mailcap
make
man-db
marisa
matlab
matlab-meta
mbedtls
mbedtls2
md4c
mdadm
media-player-info
mesa
mesa-utils
milou
miniconda3
miniupnpc
minizip
mkinitcpio
mkinitcpio-busybox
mobile-broadband-provider-info
modemmanager
modemmanager-qt
mpc
mpd
mpd-mpris
mpfr
mpg123
mpich
mpv
mtdev
mujs
namcap
ncmpcpp
ncurses
needrestart
net-tools
netpbm
nettle
network-manager-applet
networkmanager
networkmanager-qt
nm-connection-editor
nnn
node-gyp
nodejs
nodejs-nopt
noto-fonts
noto-fonts-cjk
noto-fonts-emoji
npm
npth
nspr
nss
ntfsprogs-ntfs3
numactl
nvidia
nvidia-prime
nvidia-settings
nvidia-utils
obs-studio
obsidian
ocean-sound-theme
ocl-icd
onetbb
oniguruma
openal
openblas64
opencc
opencl-nvidia
opencore-amr
openexr
openjpeg2
openlibm
openmotif
openmpi
openmpi4
openpmix
openssh
openssl
openssl-1.1
openucx
opus
orc
os-prober
otf-font-awesome
oxygen
oxygen-sounds
p11-kit
p7zip
pacman
pacman-contrib
pacman-mirrorlist
pahole
pam
pambase
pamixer
pango
pangomm
parted
paru
patch
pavucontrol
pciutils
pcre
pcre2
pcsclite
perl
perl-error
perl-libintl-perl
perl-mailtools
perl-module-find
perl-module-scandeps
perl-proc-processtable
perl-sort-naturally
perl-term-readkey
perl-timedate
phonon-qt5
phonon-qt5-vlc
phonon-qt6
phonon-qt6-vlc
pinentry
pipewire
pipewire-alsa
pipewire-audio
pipewire-jack
pipewire-pulse
pixman
pkgconf
pkgfile
plasma-activities
plasma-activities-stats
plasma-browser-integration
plasma-desktop
plasma-disks
plasma-firewall
plasma-integration
plasma-meta
plasma-nm
plasma-pa
plasma-systemmonitor
plasma-thunderbolt
plasma-vault
plasma-welcome
plasma-workspace
plasma-workspace-wallpapers
plasma5support
playerctl
plplot
polkit
polkit-kde-agent
polkit-qt6
poppler
poppler-qt6
popt
portaudio
powerdevil
ppp
print-manager
prison
prison5
procps-ng
protobuf
prrte
psmisc
purpose
pyalpm
python
python-boolean.py
python-certifi
python-charset-normalizer
python-colorama
python-decorator
python-docopt
python-gobject
python-idna
python-keyutils
python-license-expression
python-numpy
python-packaging
python-pillow
python-psutil
python-pyelftools
python-pygdbmi
python-pyte
python-requests
python-sentry_sdk
python-six
python-urllib3
python-wcwidth
python-yaml
qca-qt6
qcoro-qt6
qhull
qqc2-breeze-style
qqc2-desktop-style
qqmusic-bin
qrencode
qt5-base
qt5-declarative
qt5-location
qt5-multimedia
qt5-sensors
qt5-svg
qt5-tools
qt5-translations
qt5-wayland
qt5-webchannel
qt5-webkit
qt5-x11extras
qt5-xmlpatterns
qt6-5compat
qt6-base
qt6-declarative
qt6-imageformats
qt6-multimedia
qt6-multimedia-ffmpeg
qt6-positioning
qt6-quick3d
qt6-quicktimeline
qt6-sensors
qt6-shadertools
qt6-speech
qt6-svg
qt6-tools
qt6-translations
qt6-virtualkeyboard
qt6-wayland
qt6-webchannel
qt6-webengine
qt6-websockets
qt6-webview
rav1e
readline
rime-bopomofo
rime-cangjie
rime-essay
rime-ice-git
rime-luna-pinyin
rime-prelude
rime-stroke
rime-terra-pinyin
rnnoise
rofi
rsync
rtkit
rubberband
run-parts
sbc
scons
sdbus-cpp
sddm
sddm-kcm
sdl2
seatd
sed
seismic-unix-git
semver
serd
shaderc
shadow
shapelib
shared-mime-info
signon-kwallet-extension
signon-plugin-oauth2
signon-ui
signond
slang
slurp
smartmontools
smbclient
snappy
sndio
socat
solid
sonnet
sord
sound-theme-freedesktop
source-highlight
spdlog
speex
speexdsp
spirv-tools
sqlite
sratom
srt
startup-notification
sudo
suitesparse
svt-av1
swaybg
swayidle
swaylock-effects
swig
syndication
syntax-highlighting
systemd
systemd-libs
systemd-sysvcompat
systemsettings
taglib
talloc
tar
tcl
tdb
telegram-desktop
tevent
texinfo
thefuck
thin-provisioning-tools
thunderbird
timeshift
tk
tomlplusplus
tpm2-tss
tracker3
tslib
ttf-dejavu
ttf-hack
ttf-iosevka-nerd
ttf-liberation
ttf-material-design-icons-git
ttf-opensans
ttf-roboto
ttf-roboto-mono-nerd
twolame
tzdata
uchardet
udiskie
udisks2
ufw
unixodbc
unzip
upower
usbmuxd
util-linux
util-linux-libs
v2ray
v2ray-domain-list-community
v2ray-geoip
v2raya
v4l-utils
valgrind
vapoursynth
vid.stab
vim
vim-runtime
visual-studio-code-bin
vlc
vmaf
volume_key
vte-common
vte3
vulkan-headers
vulkan-icd-loader
vulkan-intel
vulkan-tools
vulkan-validation-layers
wavpack
waybar
wayland
wayland-protocols
wayland-utils
webrtc-audio-processing-1
wf-recorder
wget
which
wildmidi
wireless_tools
wireplumber
wl-clipboard
wlroots
woff2
wofi
wpa_supplicant
wps-office
wps-office-mui-zh-cn
wqy-zenhei
wxwidgets-common
wxwidgets-gtk3
x264
x265
xapp
xcb-imdkit
xcb-proto
xcb-util
xcb-util-cursor
xcb-util-errors
xcb-util-image
xcb-util-keysyms
xcb-util-renderutil
xcb-util-wm
xcb-util-xrm
xdg-desktop-portal
xdg-desktop-portal-gtk
xdg-desktop-portal-hyprland
xdg-desktop-portal-kde
xdg-user-dirs
xdg-utils
xerces-c
xf86-input-libinput
xkeyboard-config
xorg-fonts-encodings
xorg-mkfontscale
xorg-server
xorg-server-common
xorg-setxkbmap
xorg-xauth
xorg-xdpyinfo
xorg-xeyes
xorg-xinput
xorg-xkbcomp
xorg-xmessage
xorg-xprop
xorg-xrandr
xorg-xrdb
xorg-xset
xorg-xsetroot
xorg-xwayland
xorgproto
xsettingsd
xvidcore
xxhash
xz
yajl
yaml-cpp
zeromq
zerotier-one
zimg
zix
zlib
zotero-bin
zsh
zsh-autosuggestions
zsh-completions
zsh-history-substring-search
zsh-syntax-highlighting
zsh-theme-powerlevel10k-git
zstd
zxing-cpp
zziplib
